In [1]:
import numpy as np

In [2]:
lista_1 = np.linspace(1, 50, dtype=int)
print(lista_1)

[ 1  2  3  4  5  6  7  8  9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24
 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48
 49 50]

In [3]:
lista_2 = np.linspace(50, 150, dtype=int)
print(lista_2)

[ 50  52  54  56  58  60  62  64  66  68  70  72  74  76  78  80  82  84
  86  88  90  92  94  96  98 101 103 105 107 109 111 113 115 117 119 121
 123 125 127 129 131 133 135 137 139 141 143 145 147 150]

In [4]:
for i in lista_1:
    if i % 2 == 0:
        print(i, "es par")
    else:
        print(i, "es impar")

1 es impar
2 es par
3 es impar
4 es par
5 es impar
6 es par
7 es impar
8 es par
9 es impar
10 es par
11 es impar
12 es par
13 es impar
14 es par
15 es impar
16 es par
17 es impar
18 es par
19 es impar
20 es par
21 es impar
22 es par
23 es impar
24 es par
25 es impar
26 es par
27 es impar
28 es par
29 es impar
30 es par
31 es impar
32 es par
33 es impar
34 es par
35 es impar
36 es par
37 es impar
38 es par
39 es impar
40 es par
41 es impar
42 es par
43 es impar
44 es par
45 es impar
46 es par
47 es impar
48 es par
49 es impar
50 es par

In [5]:
divisible_2_o_3 = 0
divisible_2_y_3 = 0
divisible_3_no_2 = 0
no_divisible_2_y_3 = 0
for i in lista_2:
    if i % 2 == 0 or i % 3 == 0:
        divisible_2_o_3 += 1
    if i % 2 == 0 and i % 3 == 0:
        divisible_2_y_3 += 1
    if i % 3 == 0 and i % 2 != 0:
        divisible_3_no_2 += 1
    if i % 2 != 0 and i % 3 != 0:
        no_divisible_2_y_3 += 1

print("divisibles por 2 o 3:", divisible_2_o_3)
print("divisibles por 2 y 3:", divisible_2_y_3)
print("divisibles por 3 no 2:", divisible_3_no_2)
print("no divisibles por 2 ni 3:", no_divisible_2_y_3)

divisibles por 2 o 3: 34
divisibles por 2 y 3: 9
divisibles por 3 no 2: 8
no divisibles por 2 ni 3: 16

In [6]:
for i in range(100):
    print(i ** 2)

0
1
4
9
16
25
36
49
64
81
100
121
144
169
196
225
256
289
324
361
400
441
484
529
576
625
676
729
784
841
900
961
1024
1089
1156
1225
1296
1369
1444
1521
1600
1681
1764
1849
1936
2025
2116
2209
2304
2401
2500
2601
2704
2809
2916
3025
3136
3249
3364
3481
3600
3721
3844
3969
4096
4225
4356
4489
4624
4761
4900
5041
5184
5329
5476
5625
5776
5929
6084
6241
6400
6561
6724
6889
7056
7225
7396
7569
7744
7921
8100
8281
8464
8649
8836
9025
9216
9409
9604
9801

In [7]:
import pandas as pd

In [8]:
df = pd.read_csv('flights.csv')

In [9]:
df.head()

   year     month  passengers
0  1949   January         112
1  1949  February         118
2  1949     March         132
3  1949     April         129
4  1949       May         121

In [10]:
mean_passengers = df['passengers'].mean()
print(mean_passengers)

280.2986111111111

In [11]:
df['underperforming'] = 0

In [12]:
df.head()

   year     month  passengers  underperforming
0  1949   January         112                0
1  1949  February         118                0
2  1949     March         132                0
3  1949     April         129                0
4  1949       May         121                0

In [13]:
for index, serie in df.iterrows():
    if serie['passengers'] < mean_passengers:
        # df.at[index, 'underperforming'] = 1
        df['underperforming'].set_value(index, 1)

/Users/luisalfredoporraspaez/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:4: FutureWarning: set_value is deprecated and will be removed in a future release. Please use .at[] or .iat[] accessors instead
  after removing the cwd from sys.path.

In [14]:
df.sample(10)

     year      month  passengers  underperforming
9    1949    October         119                1
10   1949   November         104                1
111  1958      April         348                0
59   1953   December         201                1
42   1952       July         230                1
98   1957      March         356                0
81   1955    October         274                1
92   1956  September         355                0
76   1955        May         270                1
0    1949    January         112                1

In [15]:
std_passengers = np.std(df['passengers'])
print(std_passengers)

119.54904153277148

In [16]:
df['outlier'] = 0

In [17]:
df.sample(5)

     year     month  passengers  underperforming  outlier
126  1959      July         548                0        0
114  1958      July         491                0        0
29   1951      June         178                1        0
97   1957  February         301                0        0
9    1949   October         119                1        0

In [18]:
for index, serie in df.iterrows():
    if (serie['passengers'] < (mean_passengers - std_passengers)) or (serie['passengers'] > (mean_passengers + std_passengers)):
        df['outlier'].set_value(index, 1)

/Users/luisalfredoporraspaez/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:3: FutureWarning: set_value is deprecated and will be removed in a future release. Please use .at[] or .iat[] accessors instead
  This is separate from the ipykernel package so we can avoid doing imports until

In [19]:
df.sample(10)

     year      month  passengers  underperforming  outlier
125  1959       June         472                0        1
86   1956      March         317                0        0
142  1960   November         390                0        0
8    1949  September         136                1        1
34   1951   November         146                1        1
26   1951      March         178                1        0
19   1950     August         170                1        0
20   1950  September         158                1        1
79   1955     August         347                0        0
58   1953   November         180                1        0

In [20]:
df['outlier'].value_counts()

0    91
1    53
Name: outlier, dtype: int64

In [21]:
casos_extremos = df['outlier'].value_counts()[1]
print(casos_extremos)

53

In [22]:
df['underperforming'].value_counts()

1    80
0    64
Name: underperforming, dtype: int64